# [Exporting data from pandas](https://youtu.be/dA6ZksRR6aw?si=HTYvkd4G2eQofLkp&t=4887)

In [1]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [2]:
# for copying to clipboard, then you can paste it in google sheets or excel
df.to_clipboard()

In [3]:
# to_csv -> https://youtu.be/dA6ZksRR6aw?si=fS2x68dT_yT5wPHf&t=5067

# export specific columns, index=False to not export index
df.to_csv('new.csv',columns=['A','C'])

In [ ]:
# to_excel -> https://youtu.be/dA6ZksRR6aw?si=Nxss01JppIpiOBpp&t=5357
df.to_excel('new.xlsx',columns=['A','C'],index=False,sheet_name='sheet1')

In [6]:
# writing to multi sheets excel file
with pd.ExcelWriter('new.xlsx') as writer:
    df.to_excel(writer,sheet_name='sheet1')
    df.to_excel(writer,sheet_name='sheet2')

In [ ]:
# to html -> https://youtu.be/dA6ZksRR6aw?si=Au8fGJmUXSbMul1q&t=5797

# give us html table
df.to_html('new.html')

In [7]:
df.query('A > 1')

   A  B  C
1  2  5  8
2  3  6  9

In [8]:
# to_json -> https://youtu.be/dA6ZksRR6aw?si=kRQji1b6oFurKINO&t=6027
df.to_json('new.json')

In [11]:
pd.read_json('new.json')

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [ ]:
# to_sql -> https://youtu.be/dA6ZksRR6aw?si=5MGxpHOI2nsDA55E&t=6227

import pymysql
from sqlalchemy import create_engine

# {root(user name)}:{password(nothing if not set)}:@{url to server}//{database name} -> https://youtu.be/dA6ZksRR6aw?si=3i6aNKTrE_PC6TRe&t=6377
engine = create_engine('mysql+pymysql://root:@localhost/sam')

In [ ]:
# mean convert df to tablename `sampleData`, ignore if already exists

df.to_sql(name='sampleData',
          con=engine,
          if_exists='append')

C:\Users\Vedansh\AppData\Local\Temp\ipykernel_88284\2299912955.py:3: UserWarning: The provided table name 'sampleData' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df.to_sql(name='sampleData',

3